VDowbensky/HC32/HC32L07x/HC32L07x_IDE_Rev1.1.0/IAR_IDE/config/debugger/HDSC/HC32L072FAUA.svd
                <register>
                    <name>PEBSET</name>
                    <description>desc PEBSET</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PE00</name>
                            <description>desc PE00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE01</name>
                            <description>desc PE01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE02</name>
                            <description>desc PE02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE03</name>
                            <description>desc PE03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE04</name>
                            <description>desc PE04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE05</name>
                            <description>desc PE05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE06</name>
                            <description>desc PE06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE07</name>
                            <description>desc PE07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE08</name>
                            <description>desc PE08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE09</name>
                            <description>desc PE09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE10</name>
                            <description>desc PE10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE11</name>
                            <description>desc PE11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE12</name>
                            <description>desc PE12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE13</name>
                            <description>desc PE13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE14</name>
                            <description>desc PE14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE15</name>
                            <description>desc PE15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEBCLR</name>
                    <description>desc PEBCLR</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PE00</name>
                            <description>desc PE00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE01</name>
                            <description>desc PE01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE02</name>
                            <description>desc PE02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE03</name>
                            <description>desc PE03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE04</name>
                            <description>desc PE04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE05</name>
                            <description>desc PE05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE06</name>
                            <description>desc PE06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE07</name>
                            <description>desc PE07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE08</name>
                            <description>desc PE08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE09</name>
                            <description>desc PE09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE10</name>
                            <description>desc PE10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE11</name>
                            <description>desc PE11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE12</name>
                            <description>desc PE12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE13</name>
                            <description>desc PE13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE14</name>
                            <description>desc PE14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE15</name>
                            <description>desc PE15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEBSETCLR</name>
                    <description>desc PEBSETCLR</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PEBCLR</name>
                            <description>desc PEBCLR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEBSET</name>
                            <description>desc PEBSET</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEDR</name>
                    <description>desc PEDR</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PE00</name>
                            <description>desc PE00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE01</name>
                            <description>desc PE01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE02</name>
                            <description>desc PE02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE03</name>
                            <description>desc PE03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE04</name>
                            <description>desc PE04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE05</name>
                            <description>desc PE05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE06</name>
                            <description>desc PE06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE07</name>
                            <description>desc PE07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE08</name>
                            <description>desc PE08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE09</name>
                            <description>desc PE09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE10</name>
                            <description>desc PE10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE11</name>
                            <description>desc PE11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE12</name>
                            <description>desc PE12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE13</name>
                            <description>desc PE13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE14</name>
                            <description>desc PE14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PE15</name>
                            <description>desc PE15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSV</name>
                            <description>desc RSV</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
